frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/component/pdca.h
#define PDCA_PWSTALL1_OFFSET        0x82C        /**< \brief (PDCA_PWSTALL1 offset) Channel 1 Write stall Cycles */
#define PDCA_PWSTALL1_RESETVALUE    _U(0x00000000); /**< \brief (PDCA_PWSTALL1 reset_value) Channel 1 Write stall Cycles */

#define PDCA_PWSTALL1_STALL_Pos     0            /**< \brief (PDCA_PWSTALL1) Stall cycles counted since last reset */
#define PDCA_PWSTALL1_STALL_Msk     (_U(0xFFFFFFFF) << PDCA_PWSTALL1_STALL_Pos)
#define PDCA_PWSTALL1_STALL(value)  (PDCA_PWSTALL1_STALL_Msk & ((value) << PDCA_PWSTALL1_STALL_Pos))
#define PDCA_PWSTALL1_MASK          _U(0xFFFFFFFF) /**< \brief (PDCA_PWSTALL1) MASK Register */

/* -------- PDCA_PWLAT1 : (PDCA Offset: 0x830) (R/  32) Channel 1 Read Max Latency -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t LAT:16;           /*!< bit:  0..15  Maximum transfer initiation cycles counted since last reset */
    uint32_t :16;              /*!< bit: 16..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PDCA_PWLAT1_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PDCA_PWLAT1_OFFSET          0x830        /**< \brief (PDCA_PWLAT1 offset) Channel 1 Read Max Latency */
#define PDCA_PWLAT1_RESETVALUE      _U(0x00000000); /**< \brief (PDCA_PWLAT1 reset_value) Channel 1 Read Max Latency */

#define PDCA_PWLAT1_LAT_Pos         0            /**< \brief (PDCA_PWLAT1) Maximum transfer initiation cycles counted since last reset */
#define PDCA_PWLAT1_LAT_Msk         (_U(0xFFFF) << PDCA_PWLAT1_LAT_Pos)
#define PDCA_PWLAT1_LAT(value)      (PDCA_PWLAT1_LAT_Msk & ((value) << PDCA_PWLAT1_LAT_Pos))
#define PDCA_PWLAT1_MASK            _U(0x0000FFFF) /**< \brief (PDCA_PWLAT1) MASK Register */

/* -------- PDCA_VERSION : (PDCA Offset: 0x834) (R/  32) Version Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t VERSION:12;       /*!< bit:  0..11  Version Number                     */
    uint32_t :4;               /*!< bit: 12..15  Reserved                           */
    uint32_t VARIANT:4;        /*!< bit: 16..19  Variant Number                     */
    uint32_t :12;              /*!< bit: 20..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PDCA_VERSION_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PDCA_VERSION_OFFSET         0x834        /**< \brief (PDCA_VERSION offset) Version Register */
#define PDCA_VERSION_RESETVALUE     _U(0x00000124); /**< \brief (PDCA_VERSION reset_value) Version Register */

#define PDCA_VERSION_VERSION_Pos    0            /**< \brief (PDCA_VERSION) Version Number */
#define PDCA_VERSION_VERSION_Msk    (_U(0xFFF) << PDCA_VERSION_VERSION_Pos)
#define PDCA_VERSION_VERSION(value) (PDCA_VERSION_VERSION_Msk & ((value) << PDCA_VERSION_VERSION_Pos))
#define PDCA_VERSION_VARIANT_Pos    16           /**< \brief (PDCA_VERSION) Variant Number */
#define PDCA_VERSION_VARIANT_Msk    (_U(0xF) << PDCA_VERSION_VARIANT_Pos)
#define PDCA_VERSION_VARIANT(value) (PDCA_VERSION_VARIANT_Msk & ((value) << PDCA_VERSION_VARIANT_Pos))
#define PDCA_VERSION_MASK           _U(0x000F0FFF) /**< \brief (PDCA_VERSION) MASK Register */

/** \brief PdcaChannel hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
 struct {
  __IO PDCA_MAR_Type             MAR;         /**< \brief Offset: 0x000 (R/W 32) Memory Address Register */
  __IO PDCA_PSR_Type             PSR;         /**< \brief Offset: 0x004 (R/W 32) Peripheral Select Register */
  __IO PDCA_TCR_Type             TCR;         /**< \brief Offset: 0x008 (R/W 32) Transfer Counter Register */
  __IO PDCA_MARR_Type            MARR;        /**< \brief Offset: 0x00C (R/W 32) Memory Address Reload Register */
  __IO PDCA_TCRR_Type            TCRR;        /**< \brief Offset: 0x010 (R/W 32) Transfer Counter Reload Register */
  __O  PDCA_CR_Type              CR;          /**< \brief Offset: 0x014 ( /W 32) Control Register */
  __IO PDCA_MR_Type              MR;          /**< \brief Offset: 0x018 (R/W 32) Mode Register */
  __I  PDCA_SR_Type              SR;          /**< \brief Offset: 0x01C (R/  32) Status Register */
  __O  PDCA_IER_Type             IER;         /**< \brief Offset: 0x020 ( /W 32) Interrupt Enable Register */
  __O  PDCA_IDR_Type             IDR;         /**< \brief Offset: 0x024 ( /W 32) Interrupt Disable Register */
  __I  PDCA_IMR_Type             IMR;         /**< \brief Offset: 0x028 (R/  32) Interrupt Mask Register */
  __I  PDCA_ISR_Type             ISR;         /**< \brief Offset: 0x02C (R/  32) Interrupt Status Register */
       RoReg8                    Reserved1[0x10];
 } bf;
 struct {
  RwReg   PDCA_MAR;           /**< \brief (PDCA Offset: 0x000) Memory Address Register */
  RwReg   PDCA_PSR;           /**< \brief (PDCA Offset: 0x004) Peripheral Select Register */
  RwReg   PDCA_TCR;           /**< \brief (PDCA Offset: 0x008) Transfer Counter Register */
  RwReg   PDCA_MARR;          /**< \brief (PDCA Offset: 0x00C) Memory Address Reload Register */
  RwReg   PDCA_TCRR;          /**< \brief (PDCA Offset: 0x010) Transfer Counter Reload Register */
  WoReg   PDCA_CR;            /**< \brief (PDCA Offset: 0x014) Control Register */
  RwReg   PDCA_MR;            /**< \brief (PDCA Offset: 0x018) Mode Register */
  RoReg   PDCA_SR;            /**< \brief (PDCA Offset: 0x01C) Status Register */
  WoReg   PDCA_IER;           /**< \brief (PDCA Offset: 0x020) Interrupt Enable Register */
  WoReg   PDCA_IDR;           /**< \brief (PDCA Offset: 0x024) Interrupt Disable Register */
  RoReg   PDCA_IMR;           /**< \brief (PDCA Offset: 0x028) Interrupt Mask Register */
  RoReg   PDCA_ISR;           /**< \brief (PDCA Offset: 0x02C) Interrupt Status Register */
  RoReg8  Reserved2[0x10];
 } reg;
} PdcaChannel;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

